package stat

import "sort"

var g_sysType = map[int32]string{
	0:   "所有",
	1:   "创建房间",
	2:   "退出房间",
	3:   "充值",
	4:   "后台接口",
	5:   "商店",
	6:   "任务领取",
	7:   "金币场",
	8:   "比赛场",
	9:   "亲友圈升级",
	10:  "签到",
	11:  "情义奖",
	12:  "邮件",
	13:  "邀请有礼",
	14:  "看广告领奖",
	15:  "金币补给",
	16:  "红包场报名",
	17:  "红包领取",
	18:  "红包雨领取",
	19:  "金币场扣费",
	20:  "房间扔鸡蛋",
	21:  "雀神对决开始",
	22:  "雀神对决结束",
	23:  "金币场礼包分享",
	24:  "试玩分享",
	25:  "金币场赢分享",
	26:  "商店兑换分享",
	27:  "金币补给分享",
	28:  "VIP奖励",
	29:  "每日登录",
	30:  "添加到我的小程序",
	31:  "纸巾机分享给红包",
	32:  "联系客服领取",
	33:  "大转盘奖励",
	34:  "排位赛赢分享",
	35:  "排位赛",
	36:  "排位赛输分享",
	37:  "锦鲤奖励",
	38:  "道具使用",
	39:  "道具BUFF购买(牌局中)",
	40:  "道具BUFF购买(杠上花)",
	41:  "道具BUFF购买(海底捞)",
	42:  "新手奖励",
	43:  "大奖赛",
	44:  "大奖赛报名",
	45:  "大奖赛分享领取",
	46:  "大奖赛返还",
	47:  "登录话费",
	61:  "签到额外赠送",
	62:  "签到分享",
	63:  "徒弟进贡",
	64:  "徒弟任务",
	65:  "徒弟签到",
	66:  "看视频加倍救济金",
	67:  "看视频零金币赠送",
	68:  "看视频金币场输返回",
	69:  "看视频金币场赢加成",
	70:  "看视频金币场结束随机金币",
	71:  "看视频金币场红包加成",
	72:  "看视频金币场下一局红包加成",
	73:  "看视频金币场下一局看底牌",
	74:  "看视频随机金币",
	75:  "分享获得红包",
	76:  "乐趣出纸",
	77:  "记牌器消耗",
	78:  "看视频随机红包",
	79:  "随机金币(下一局)",
	80:  "随机金币(playGamePb界面加号）",
	81:  "随机金币(playGamePb的icon）",
	82:  "随机金币(大厅界面加号)",
	83:  "随机金币(大厅界面金币不足)",
	84:  "随机金币(游戏内弹出的宝箱界面)",
	85:  "随机金币(游戏内点击获取金币toggle)",
	86:  "登录随机获得红包券",
	87:  "看视频获得记牌器",
	88:  "每小时红包",
	89:  "新用户红包",
	90:  "红包场对局(斗地主)",
	91:  "红包场场次费(斗地主)",
	92:  "大奖赛抽奖",
	93:  "玩小游戏",
	94:  "看视频加倍奖励红包券",
	95:  "看视频金币场下局免扣金币",
	96:  "亲友圈VIP升级",
	97:  "查看记牌器",
	98:  "翻牌系统抽牌",
	99:  "翻牌系统进度奖励",
	100: "看视频得翻牌系统硬币",
	101: "签到看视频",
	102: "收徒页开宝箱",
	103: "收徒页宝箱分享",
	104: "收徒页宝箱分享点击链接",
	105: "提现审核开始提现",
	106: "提现审核立即提现",
	107: "提现审核页看视频",
	108: "试玩小游戏",
	109: "收徒召回",
}

const (
	LOG_RES_OUTPUT  int32 = 1
	LOG_RES_CONSUME int32 = 2
)

func sortedSystemKeys() (keys []int32) {
	for k := range g_sysType {
		keys = append(keys, k)
	}
	sort.Slice(keys, func(i, j int) bool { return keys[i] < keys[j] })
	return
}

const (
	ROOM_ALL    int32 = 0
	ROOM_NORMAL int32 = 1
	ROOM_GOLD   int32 = 2
	ROOM_CIRCLE int32 = 4
	ROOM_PLACE  int32 = 7
	ROOM_MATCH  int32 = 100
)

var g_mapRoom map[int32]string = map[int32]string{
	ROOM_ALL:        "all",
	ROOM_NORMAL:     "普通房",
	ROOM_GOLD:       "金币场",
	ROOM_CIRCLE:     "亲友圈",
	ROOM_PLACE:      "排位赛",
	ROOM_MATCH + 4:  "红包赛4人场", //避免重复+100
	ROOM_MATCH + 16: "红包赛16人场",
	ROOM_MATCH + 32: "红包赛32人场",
	2001:            "巅峰红包赛16人场",
	2002:            "巅峰红包赛32人场",
	2003:            "巅峰红包赛64人场",
	3001:            "激情1元话费赛",
	3002:            "激情5元话费赛",
	3003:            "激情10元话费赛",
	5001:            "红包赛51人场",
	5002:            "红包赛66人场",
	5003:            "红包赛81人场",
	6001:            "话费赛51人场",
	6002:            "话费赛66人场",
	6003:            "话费赛81人场",
}

var g_mapRule map[int32]string = map[int32]string{
	0:    "all",
	1000: "斗地主二人场",
	1001: "斗地主经典场",
	1002: "斗地主不洗牌",

	4005: "血战到底",
	4006: "血流成河",

	5001: "红中麻将",
	5002: "转转麻将",
	5021: "长沙麻将",
	5041: "衡阳麻将",
	5061: "永州麻将",
	5081: "邵阳麻将",
	5101: "常德麻将",
	5102: "常德红中",
	5121: "益阳麻将",
	5141: "郴州麻将",
	5161: "岳阳麻将",
	5181: "湘潭麻将",
	5201: "怀化麻将",
	5221: "娄底麻将",
	5241: "湘西麻将",
	5261: "张家界麻将",
	5281: "株洲麻将",

	7001: "黄岩麻将",
	7002: "椒江麻将",
	7003: "路桥麻将",
	7004: "临海麻将",
	7005: "三门麻将",
	7006: "玉环麻将",
	7007: "杜桥麻将",
	7008: "天台麻将",
	7009: "温岭麻将",
	7021: "杭州麻将",
	7041: "金华麻将",
	7061: "湖州麻将",
	7081: "嘉兴麻将",
	7121: "宁波麻将",
	7141: "绍兴麻将",
	7161: "温州麻将",

	8021: "合肥麻将",
	8041: "芜湖麻将",
	8061: "蚌埠麻将",
	8081: "淮南麻将",
	8101: "铜陵麻将",
	8121: "阜阳麻将",
	8141: "淮北麻将",
	8161: "宿州麻将",
	8181: "安庆麻将",
	8201: "六安麻将",
	8221: "马鞍山麻将",
	8241: "滁州麻将",
	8261: "宣城麻将",
	8281: "池州麻将",
	8301: "亳州麻将",
	8321: "黄山麻将",

	32001: "上海麻将",

	10001: "广东麻将",
	13031: "贵阳捉鸡",

	15021: "郑州麻将",
	15041: "南阳麻将",
	15061: "开封麻将",
	15081: "商丘麻将",
	15101: "安阳麻将",
	15121: "信阳麻将",
	15141: "洛宁麻将",
	15161: "焦作麻将",
	15181: "驻马店麻将",
	15201: "洛阳麻将",
	15221: "平顶山麻将",
	15241: "新乡麻将",
	15261: "周口麻将",
	15281: "三门峡麻将",
	15301: "鹤壁麻将",

	17021: "哈尔滨麻将",

	18001: "湖北红中",
	18002: "湖北七皮",
	18021: "武汉麻将",
	18041: "随州卡五星",
	18061: "襄阳麻将",
	18081: "孝感麻将",
	18101: "十堰麻将",

	21031: "鞍山麻将",

	25021: "济南麻将",
	25041: "菏泽麻将",
	25061: "济宁麻将",
	25081: "聊城麻将",
	25101: "枣庄麻将",
	25121: "泰安麻将",
	25141: "德州麻将",
	25161: "临沂麻将",
	25181: "日照麻将",
	25201: "淄博麻将",
	25221: "滨州麻将",
	25241: "青岛麻将",
	25261: "潍坊麻将",
	25281: "东营麻将",
	25301: "烟台麻将",
	25321: "威海麻将",

	26021: "太原麻将",
	26022: "吕梁麻将",

	38001: "国标麻将",
	38002: "推倒胡",
	38003: "两报扣",
	38004: "大众麻将",
}

var g_rule3Pers []int32 = []int32{7008, 18041, 18061, 18081, 18101}

func Is3PersRule(ruleId int32) bool {
	for _, v := range g_rule3Pers {
		if v == ruleId {
			return true
		}
	}
	return false
}
