const g_gameChan = {
	0: {
		"所有app渠道": "515100~515199,100000",
	},
	//5151麻将
	101: {
		"微信麻将": "519900", //(微信小游戏)
	},
	//乐游斗地主
	201: {
		"纸巾机包": "515100", //（安卓&ios）
		"分享包": "515101", //（安卓）
		"appstroe包": "515102", //（ios）
		"应用宝包": "515103", //（安卓）
		"纸巾机身广告": "515104~515106", //（安卓）
	},
	//小米斗地主
	203: {
		"小米落地页导量": "515150~515169", //（安卓）
		"小米分享包": "515188", //（安卓）
		"小米商城买量": "515189", //（安卓）
		"趣头条买量": "515120,515121,515123~515125", //（安卓）
		"趣头条分享包": "515122", //（安卓）
		"中转页包": "515126", //（安卓）
		"闪电盒子买量": "515107~515110", //（安卓）
		"闪电盒子分享包": "515111", //（安卓）
	},
	//斗地主测试服
	204: {
		"外网测试包": "100000", //（安卓）
	},
	//5151斗地主
	206: {
		"微信斗地主": "519901", //(微信小游戏)
	}
}